Oleksandra2020/cycling_glove/Read_gyroscope1.1.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "I2C_MPU6050.h"
#include "I2C_MPU6050_I2C.h"
#include "I2C_MPU6050_PINS.h"
#include "I2C_MPU6050_I2C_PVT.h"
#include "I2C_MPU6050_PVT.h"
#include "I2C_MPU6050_BOOT.h"
#include "BLE_gatt.h"
#include "BLE.h"
#include "BLE_HAL_PVT.h"
#include "BLE_STACK_PVT.h"
#include "BLE_StackGap.h"
#include "BLE_StackGatt.h"
#include "BLE_StackGattDb.h"
#include "BLE_StackHostMain.h"
#include "BLE_StackL2cap.h"
#include "BLE_StackGattServer.h"
#include "BLE_StackGattClient.h"
#include "BLE_Stack.h"
#include "BLE_eventHandler.h"
#include "BLE_ans.h"
#include "Timer_Pin.h"
#include "Timer_Pin_aliases.h"
#include "Timer_Int.h"
#include "Clock_1MHz.h"
#include "PWM_0_Int.h"
#include "PWM_0_Out.h"
#include "PWM_0_Out_aliases.h"
#include "PWM_1_Out.h"
#include "PWM_1_Out_aliases.h"
#include "PWM_2_Out.h"
#include "PWM_2_Out_aliases.h"
#include "Timer.h"
#include "PWM_2.h"
#include "PWM_1.h"
#include "PWM_0.h"
#include "ADC_EOC_Int.h"
#include "DieTemp.h"
#include "ADC_2_Buffer.h"
#include "ADC_3_Buffer.h"
#include "ADC_0.h"
#include "ADC_0_aliases.h"
#include "ADC_1P.h"
#include "ADC_1P_aliases.h"
#include "ADC_1M.h"
#include "ADC_1M_aliases.h"
#include "ADC_2.h"
#include "ADC_2_aliases.h"
#include "ADC_3.h"
#include "ADC_3_aliases.h"
#include "ADC.h"
#include "Output_Pin_0.h"
#include "Output_Pin_0_aliases.h"
#include "Output_Pin_1.h"
#include "Output_Pin_1_aliases.h"
#include "Input_Pin_0.h"
#include "Input_Pin_0_aliases.h"
#include "Input_Pin_1.h"
#include "Input_Pin_1_aliases.h"
#include "Input_0_Int.h"
#include "Input_1_Int.h"
#include "CompM_0.h"
#include "CompM_0_aliases.h"
#include "CompP_0.h"
#include "CompP_0_aliases.h"
#include "Comp_0.h"
#include "RTC.h"
#include "Comp_1.h"
#include "CompP_1.h"
#include "CompP_1_aliases.h"
#include "CompM_1.h"
#include "CompM_1_aliases.h"
#include "LPComp_Int.h"
#include "Wakeup_Pin.h"
#include "Wakeup_Pin_aliases.h"
#include "Wakeup_Pin_Int.h"
#include "CapSense.h"
#include "CapSense_CSHL.h"
#include "CapSense_TunerHelper.h"
#include "CapSense_SMS.h"
#include "CapSense_PVT.h"
#include "CapSense_IP.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "I2C_MPU6050_SCBCLK.h"
#include "I2C_MPU6050_sda.h"
#include "I2C_MPU6050_sda_aliases.h"
#include "I2C_MPU6050_scl.h"
#include "I2C_MPU6050_scl_aliases.h"
#include "I2C_MPU6050_SCB_IRQ.h"
#include "BLE_bless_isr.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "CapSense_SampleClk.h"
#include "CapSense_Sns_aliases.h"
#include "CapSense_SenseClk.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

